# Размеры игрового окна
WIDTH = 500 # ширина окна в px
HEIGHT = round(WIDTH + 100 ) # высота окна в px

FPS = 60 # лимит FPS игры

# Цвета интерфейса и поля
BG_COLOR = (30, 30, 30) # фон окна
LINE_COLOR = (120, 120, 120) # линии сетки
LINE_DOWN_COLOR = (120, 120, 0) # нижняя линия для разделения поля и интерфейса

TITLE = "Нолики-Крестики" # название окна


# Настройки игровой сетки
GRID_MODES = {
    3: {"cell_size": 3, "line_count": 2},  # поле 3х3: 2 линии
    4: {"cell_size": 4, "line_count": 3},  # поле 4х4: 3 линии
    5: {"cell_size": (WIDTH - 50) // 5, "line_count": 4}   # поле 5х5: 4 линии
}