# Размеры игрового окна
WIDTH = 1000 # ширина окна в px
HEIGHT = 650 # высота окна в px

FPS = 60 # лимит FPS игры

# Цвета интерфейса
BG_COLOR = (30, 30, 30) # фон окна
LINE_COLOR = (120, 120, 120) # линии сетки

TITLE = "Нолики-Крестики" # название окна


# Настройки игровой сетки
GRID_MODES = {
    3: {"cell_size": 200, "line_count": 2},  # поле 3х3: клетка 200px, 2 линии
    4: {"cell_size": 150, "line_count": 3},  # поле 4х4: клетка 150px, 3 линии
    5: {"cell_size": 120, "line_count": 4}   # поле 5х5: клетка 120px, 4 линии
}